/* info window version */
"<version> (needs update)" = "<version> (tarvitsee päivityksen)";

/* info window version */
"<version> (up to date)" = "<version> (ei tarvitse päivitystä)";

/* Return Character */
"\r" = "\r";

/* detail of error message */
"A single iPod was detected, but it must be mounted on the desktop for this operation to work." = "Yksi iPod tunnistettiin, mutta sen on oltava työpöydällä, jotta toiminto voidaan suorittaa.";

/* menu item */
"About iPod Updater" = "Tietoja iPod-päivittäjästä";

/* detail of confirmation message */
"All data currently stored on the iPod will be lost." = "Kaikki iPodiin tallennetut tiedot poistetaan.";

/* error message */
"An error occurred. There may be open files on the iPod." = "Tapahtui virhe. iPodin tiedostoja saattaa olla avoinna.";

/* main window message */
"An iPod is attached, but not mounted on the desktop." = "iPod on liitetty, mutta se ei ole työpöydällä.";

/* error message */
"An unexpected error occurred." = "Tapahtui odottamaton virhe.";

/* confirmation message */
"Are you sure you want to restore the iPod software?" = "Haluatko varmasti palauttaa iPodin ohjelmiston?";

/* text next to lock when unlocking */
"Authenticating..." = "Määritellään...";

/* info window label */
"Capacity:" = "Tallennustila:";

/* text next to lock when locked */
"Click the lock to make changes." = "Osoita lukkoa tehdäksesi muutoksia.";

/* text next to lock when unlocked */
"Click the lock to prevent further changes." = "Osoita lukkoa estääksesi muutokset.";

/* menu item */
"Close Window" = "Sulje ikkuna";

/* menu item */
"Copy" = "Kopioi";

/* error message */
"Could not find a SysInfo file on the iPod disk." = "iPodin levyltä ei löytynyt SysInfo-tiedostoa.";

/* error message */
"Could not find updater library." = "Päivittäjäkirjastoa ei löytynyt.";

/* menu item */
"Cut" = "Leikkaa";

/* progress message */
"Done restoring iPod software" = "iPodin ohjelmisto on palautettu";

/* progress message */
"Done updating iPod software" = "iPodin ohjelmisto on päivitetty";

/* menu title */
"Edit" = "Muokkaus";

/* detail of confirmation message */
"If you quit while an operation is in progress, you may need to restore the iPod software later." = "Jos lopetat kun jokin toiminto on kesken, iPodin ohjelmisto on ehkä palautettava myöhemmin.";

/* main window title */
"iPod Software <version> Updater" = "iPod-ohjelmiston <version> päivittäjä";

/* about window firmware version line */
"iPod Software Version <version>" = "iPod-ohjelmistoversio <version>";

/* main window title */
"iPod Windows Software <version> Updater" = "iPodin Windows-ohjelmiston <version> päivittäjä";

/* error message */
"More than one iPod is attached." = "Useampi kuin yksi iPod on liitettynä.";

/* main window message */
"More than one iPod is attached. Please attach one iPod at a time to be updated." = "Useampi kuin yksi iPod on liitettynä. Liitä päivitettäväksi vain yksi iPod kerrallaan.";

/* info window label */
"Name:" = "Nimi:";

/* error message */
"No iPod is attached." = "Yhtään iPodia ei ole liitetty.";

/* button for main window */
"Nothing" = "Ei mitään";

/* menu title */
"Options" = "Valinnat";

/* error message */
"Out of memory." = "Muisti loppu.";

/* menu item */
"Paste" = "Sijoita";

/* detail of error message */
"Please attach one iPod at a time to be updated." = "Liitä päivitettäväksi vain yksi iPod kerrallaan.";

/* main window message */
"Plug in an iPod to update it." = "Liitä iPod päivitystä varten.";

/* Quit command key */
"Q" = "Q";

/* menu item */
"Quit" = "Lopeta";

/* confirmation dialog title */
"Quit " = "Lopeta ";

/* confirmation message */
"Quit while this operation is in progress?" = "Lopetetaanko toiminnon ollessa kesken?";

/* Restore iPod command key */
"R" = "R";

/* message for main window */
"Reset iPod to Windows factory settings. \rAll music and data will be erased." = "Palauta iPod Windowsin tehdasasetuksiin. \rKaikki musiikki ja tiedot poistetaan.";

/* button for main window */
"Restore" = "Palauta";

/* confirmation dialog title */
"Restore " = "Palauta ";

/* message for main window */
"Restore completely erases your iPod and applies factory settings. Your music and other data will be erased." = "Palautus tyhjentää iPodin kokonaan ja palauttaa tehdasasetukset. Musiikki ja tallennetut tiedot poistetaan.";

/* menu item */
"Restore iPod" = "Palauta iPod";

/* progress message */
"Restoring iPod software" = "iPodin ohjelmistoa palautetaan";

/* info window label */
"Serial Number:" = "Sarjanumero:";

/* info window label */
"Software Version:" = "Ohjelmistoversio:";

/* button in progress sheet */
"Stop" = "Seis";

/* main window message */
"The attached iPod does not have proper software on it." = "Liitetyssä iPodissa ei ole oikeaa ohjelmistoa.";

/* error message */
"The iPod could not be unmounted because it is in use. Please close any open files on the iPod and try again." = "iPodia ei voitu tuoda näkyviin, koska se on käytössä. Sulje kaikki iPodin auki olevat tiedostot ja yritä uudelleen.";

/* error message */
"The iPod disk does not have the correct structure." = "iPod-levyn rakenne ei ole kelvollinen.";

/* error message */
"The iPod is not mounted." = "iPod ei ole työpöydällä.";

/* detail of error message */
"The iPod Updater application may be damaged." = "iPod-päivittäjäohjelmisto saattaa olla vahingoittunut.";

/* error message */
"The iPod Updater requires CarbonLib 1.4 or newer." = "iPod-päivittäjä vaatii CarbonLib 1.4:n tai uudemman.";

/* error message */
"The iPod Updater requires Mac OS X." = "iPod-päivittäjä vaatii Mac OS X:n.";

/* detail of error message, part in <> is replaced and should not be translated) */
"The Mac OS error code was <error>." = "Mac OS -virhekoodi on <error>.";

/* error message */
"The updater does not have a firmware image." = "Päivittäjällä ei ole firmware-kuvausta.";

/* error message */
"The updater does not have a volume image." = "Päivittäjällä ei ole taltiokuvausta.";

/* button for main window */
"Update" = "Päivitä";

/* menu item */
"Update iPod" = "Päivitä iPod";

/* message for main window */
"Update puts the latest system software on your iPod." = "Päivitys asentaa uusimman käyttöjärjestelmän iPodiin.";

/* progress message */
"Updating iPod software" = "iPodin ohjelmistoa päivitetään";

/* about window app version line */
"Version <version>" = "Versio <version>";

/* Close Window command key */
"W" = "W";

/* main window message */
"Your iPod has been restored to factory settings, and is restarting. Please leave the iPod connected and wait while it completes the restore process." = "iPod on palautettu tehdasasetuksiin, ja se käynnistyy uudelleen. Pidä iPod liitettynä ja odota kunnes palautus on suoritettu loppuun.";

/* main window message */
"Your iPod has been restored to factory settings. Please eject and then unplug and replug the iPod so it can complete the restore process." = "iPod on palautettu tehdasasetuksiin. Poista se työpöydältä ja irrota ja liitä sitten takaisin sen kaapeli, jotta palautus voidaan saattaa loppuun.";

/* main window message */
"Your iPod has been restored to factory settings. Please unplug and replug the iPod so it can complete the restore process." = "iPod on palautettu tehdasasetuksiin. Irrota sen kaapeli ja liitä se sitten uudelleen, jotta palautus voidaan suorittaa loppuun.";

/* main window message */
"Your iPod has been updated to version <version>, and is restarting. Please leave the iPod connected and wait while it completes the update process." = "iPod on päivitetty versioon <version>, ja se käynnistyy uudelleen. Pidä iPod liitettynä ja odota kunnes palautus on suoritettu loppuun.";

/* main window message */
"Your iPod has been updated to version <version>. Please eject and then unplug and replug the iPod so it can complete the update process." = "iPod on päivitetty versioon <version>. Poista iPod työpöydältä ja irrota ja liitä sitten uudelleen sen kaapeli, jotta päivitys voidaan suorittaa loppuun.";

/* main window message */
"Your iPod has been updated to version <version>. Please unplug and replug the iPod so it can complete the update process." = "iPod on päivitetty versioon <version>. Irrota sen kaapeli ja liitä se sitten uudelleen, jotta päivitys voidaan suorittaa loppuun.";

